app/controllers/games_controller.rb

  def index
    @title = "Gletscherspatler.ch::Spiele"
    @season = Season.where("start_year = ? AND end_year = ?", params[:start], params[:end]).first

    respond_to do |format|
      if @season
        @games = @season.games.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM "games" WHERE (result != '') ORDER BY date DESC LIMIT 1