app/controllers/locations_controller.rb

  def index
    @locations = Location.find :all, :order => "name"
---
SELECT * FROM "locations"