app/controllers/players_controller.rb

  def index
    @players = Player.all.group_by(&:position)
---
SELECT * FROM "players" WHERE (position = 'FW')