app/controllers/players_controller.rb

  def new
    @user = User.find(params[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1