app/controllers/topics_controller.rb

SELECT * FROM "topics"
---
  def index
    @topics = Topic.all.paginate :page => params[:page], :per_page => 15

SELECT "posts".* FROM "posts" WHERE ("posts".topic_id = 953125641)
SELECT * FROM "topics" WHERE ("topics"."id" = 953125641)
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @topic = Topic.find(params[:id], :include => {:posts => :user})

SELECT * FROM "topics" WHERE ("topics"."id" = 953125641)
---
  def edit
    @topic = Topic.find(params[:id])

INSERT INTO "topics" ("updated_at", "title", "created_at") VALUES('2009-06-09 13:51:58', NULL, '2009-06-09 13:51:58')
---
  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save

SELECT * FROM "topics" WHERE ("topics"."id" = 953125641)
---
  def update
    @topic = Topic.find(params[:id])

SELECT * FROM "topics" WHERE ("topics"."id" = 953125641)
DELETE FROM "topics" WHERE "id" = 953125641
---
  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy