app/controllers/users_controller.rb

SELECT * FROM "users" ORDER BY name
---
  def index
    @users = []

    if params[:usr_name] && !params[:usr_name].blank?
      @users = User.find_by_first_or_lastname(params[:usr_name])
    elsif params[:score] && !params[:score][:player].blank?
      @users = User.find_by_first_or_lastname(params[:score][:player])
    else
      @title = "Gletscherspatler.ch::Benutzer"
      @users = User.all