app/controllers/users_controller.rb

  def index
    @title = "Gletscherspatler.ch::Benutzer"
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])
    @user.user_name = "#{@user.first_name.downcase}.#{@user.name.downcase}"
---
SELECT "users".id FROM "users" WHERE ("users"."user_name" IS NULL) LIMIT 1